app/controllers/admin/productions_controller.rb

SELECT `productions`.* FROM `productions`
---
    def index
        @products = Production.all

INSERT INTO `productions` (`name`, `category_id`, `description`, `created_at`, `updated_at`, `image_url`) VALUES ('galaxy s12', 1, 'dien thoai han quoc cua sam sung', '2021-04-10 15:37:12.062621', '2021-04-10 15:37:12.062621', 'https://cdn.tgdd.vn/Products/Images/42/206176/samsung-galaxy-note-10-plus-silver-new-600x600.jpg')
---
    def create
        @product = Production.new(product_params)
        if @product.save!

SELECT `productions`.* FROM `productions` WHERE `productions`.`id` = 1 LIMIT 1
---
    def edit
        @product = Production.find_by(id: params[:id])

SELECT `productions`.* FROM `productions` WHERE `productions`.`id` = 1 LIMIT 1
UPDATE `productions` SET `productions`.`name` = 'note 11', `productions`.`category_id` = 2, `productions`.`description` = 'dien thoai han quoc', `productions`.`updated_at` = '2021-04-10 15:31:45.801374' WHERE `productions`.`id` = 2
---
    def update
        @product = Production.find_by(id: params[:id])
        if @product.update product_params