app/controllers/admin/users_controller.rb

    def index
        if current_user.role.role_name  == "super_admin"
            @users = User.joins('inner join roles on users.role_id = roles.id where roles.role_name != "super_admin"')
---
SELECT `users`.* FROM `users` inner join roles on users.role_id = roles.id where roles.role_name != "super_admin"

    def edit
        @user = User.find_by id: params[:id]
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1

    def update

        @user = User.find_by id: params[:id]
        if @user.update! role_id: user_params[:role_id].to_i
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `users`.`updated_at` = '2021-04-10 10:42:29.380925', `users`.`role_id` = 2 WHERE `users`.`id` = 2