app/views/productions/show.html.erb

        <ul class = "brand-category" style = "list-style: none">
            <%Category.all.each do |c|%>
---
SELECT `categories`.* FROM `categories`

                                    <div class = "row row-cols-9">
                                        <%@product.production_details.each do |item|%>
---
SELECT `production_details`.* FROM `production_details` WHERE `production_details`.`production_id` = 4