app/helpers/application_helper.rb

SELECT `categories`.`id`, `categories`.`category_name` FROM `categories`
---
    def categories
        Category.select(:id,:category_name)

SELECT `cards`.* FROM `cards` WHERE `cards`.`user_id` = 1 LIMIT 1
INSERT INTO `cards` (`user_id`, `created_at`, `updated_at`) VALUES (1, '2021-04-11 06:12:12.527779', '2021-04-11 06:12:12.527779')
---
    def current_cart
        if current_user.present?
            if session[:card_id].present?
                cart = Card.find_by id: session[:card_id]
            elsif cookies.permanent.signed[:cart_id].present?
                cart = Card.find_by id: cookies.signed[:card_id]
            elsif current_user.card.present?
                cart = current_user.card

            else
                cart = Card.new
                cart.user = current_user
                cart.save