app/views/cards/show.html.erb

SELECT `card_products`.* FROM `card_products` WHERE `card_products`.`card_id` = 1
---
    <tbody>
        <%current_cart.card_products.each do |item|%>