app/controllers/card_products_controller.rb

  def create
    @cart_product = CardProduct.new(card_id: params[:card_id],production_detail_id: params[:production_detail_id], quantity: params[:quantity])
    if @cart_product.save
---
INSERT INTO `card_products` (`card_id`, `production_detail_id`, `quantity`, `created_at`, `updated_at`) VALUES (1, 7, 1, '2021-04-11 08:32:27.947099', '2021-04-11 08:32:27.947099')

  def destroy
    @cart_product = CardProduct.find_by id: params[:id]
    @cart_product.destroy
---
SELECT `card_products`.* FROM `card_products` WHERE `card_products`.`id` = 6 LIMIT 1
DELETE FROM `card_products` WHERE `card_products`.`id` = 6