app/controllers/productions_controller.rb

SELECT `productions`.* FROM `productions` WHERE `productions`.`id` = 1 LIMIT 1
---
  def show
    @product = Production.find_by(id: params[:id])