app/controllers/static_pages_controller.rb

SELECT `categories`.* FROM `categories`
SELECT `productions`.* FROM `productions`
---
  def home
    @categories = Category.all
    @products = Production.all