app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`, `role_id`) VALUES ('pred_preice', 'user_1@lehiep.com', '2021-04-09 13:59:06.479581', '2021-04-09 13:59:06.479581', '$2a$12$63QYHX3vIDtMI79a.DOkCOttKptsc8dxVcisxProME4qs9aBA6cRC', 3)
---
  def create
    @user = User.new(user_params)
    byebug
    if @user.role_id == 3
      if @user.save!

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def find_user
    @user = User.find_by(id: params[:id])