app/views/categories/show.html.erb

        <ul class = "brand-category" style = "list-style: none">
            <%Category.all.each do |c|%>
---
SELECT `categories`.* FROM `categories`